Repository: luc-github/horus
Catalog: doc/readthedocs/locale/*/LC_MESSAGES/source.po
Languages: es

source: Getting started
es: Primeros pasos

source: Horus is a multiplatform application to experiment with the `open 3D scanner Ciclop`_.
es: Horus es una aplicación multiplataforma para experimentar con el `escáner 3D libre Ciclop`_.

source: It provides a graphical interface that allows you to connect the scanner, control its devices, set scanning parameters, calibrate the scanner and scan 3D objects with Ciclop. It also includes a 3D scene of the point cloud obtained in real time.
es: Proporciona una interfaz gráfica que permite conectarse al escáner, controlar sus dispositivos, ajustar los parámetros de escaneado, autocalibrar el escáner y escanear objetos en 3D con Ciclop. Incluye además un visualizador de la nube de puntos obtenida en tiempo real.

source: It was created by `bqlabs`_, the Department of Innovation and Robotics at `BQ`_, developed in `Python`_ and released under the `GPLv2`_ license.
es: Ha sido creado por `bqlabs`_, el Departamento de Innovación y Robótica de `BQ`_, desarrollado en `Python`_ y liberado bajo la licencia `GPLv2`_.

source: File
es: Fichero

source: **Launch wizard**: opens the *Wizard*.
es: **Lanzar wizard**: abre la ventana de *Wizard*.

source: **Open model**: opens a 3D model (*ply* point cloud or *stl* mesh).
es: **Cargar modelo**: abre el modelo 3D (nube de puntos en *ply* o malla en *stl*).

source: **Save model**: saves the point cloud of the 3D scene in *ply* format.
es: **Guardar modelo**: guarda la nube de puntos de la escena 3D en formato *ply*.

source: **Clear model**: removes the current 3D model from the 3D scene.
es: **Borrar modelo**: elimina el modelo actual de la escena 3D.

source: **Open profile**: loads all the control, adjustment and scanning parameters.
es: **Abrir perfil**: carga todos los parámetros de control, ajuste y escaneo.

source: **Save profile**: saves all the control, adjustment and scanning parameters in JSON format.
es: **Guardar perfil**: guarda en formato JSON todos los parámetros de control, ajuste y escaneo.

source: **Reset profile**: resets all the control, adjustment and scanning parameters to the default values.
es: **Resetear perfil**: resetea al valor por defecto todos los parámetros de control, ajuste y escaneo.

source: **Open calibration**: loads all the calibration parameters.
es: **Abrir calibración**: carga todos los parámetros de calibración.

source: **Save calibration**: saves all the calibration parameters in JSON format.
es: **Guardar calibración**: guarda en formato JSON todos los parámetros de calibración.

source: **Reset calibration**: resets all the calibration parameters to the default values.
es: **Resetear calibración**: resetea al valor por defecto todos los parámetros de calibración.

source: **Export log**: saves a log file with the registry of the previous commands.
es: **Exportar log**: guarda un fichero .log con el registro de las ejecuciones previas.

source: **Clear log**: removes the log file. It is automatically removed each 7 days.
es: **Eliminar log**: borra el fichero de registro. Se borra automáticamente cada 7 días.

source: **Exit**: closes the application.
es: **Salir**: cierra la aplicación.

source: Edit
es: Editar

source: **Preferences**: opens the complete preferences window:
es: **Preferencias**: abre la ventana de preferencias completa:

source: **Connection section**: *Camera ID*, *Serial name* and *Baud rate*.
es: **Sección de conexión**: *ID de la cámara*, *Nombre del puerto serie* y *Velocidad de transmisión*.

source: **Adjustment section**: *Luminosity* and *Invert the motor direction*.
es: **Sección de ajuste**: *Luminosidad* e *Invertir sentido del motor*.

source: **Firmware section**: allows to upload the default or a selected firmware to *BT ATmega328* and *Arduino UNO* boards. Also, it can clear EEPROM before uploading the firmware.
es: **Sección de firmware**: permite cargar el firmware por defecto o uno seleccionado a las placas *BT ATmega328* y *Arduino UNO*. Además se puede limpiar la EEPROM antes de cargar el firmware.

source: **Language section**: allows to select the application's current language.
es: **Sección de idioma**: permite seleccionar el idioma actual de la aplicación.

source: The *Firmware section* is only enabled if the scanner is disconnected.
es: La *Sección de firmware* sólo está habilitada si el escáner está desconectado.

source: View
es: Vista

source: This menu shows and hides the *Scanning workbench* panels: the configuration panel, the video and the 3D scene.
es: Este menú permite mostrar y ocultar las ventanas visibles en el *Banco de trabajo de escaneado*: el panel de configuración, el video y la escena 3D.

source: It also contains the *Advanced mode* option, that enables advanced options in *Calibration workbench*.
es: También contiene el "Modo Avanzado", que habilita las optiones avanzas en el *Banco de trabajo de calibración*.

source: Help
es: Ayuda

source: In this menu you can open the *Welcome* window, check for updates and to access to project's web resources.
es: En este menu se puede abrir la ventana de *Bienvenida*, comprobar si hay actualizaciones y acceder a los recursos web del proyecto.

source: Workbench combo box
es: Combo box de bancos de trabajo

source: With this combo box, the current workbench is selected.
es: Con este como box, se selecciona el actual banco de trabajo.

source: Scanning
es: Escaneo

source: To start scanning press the *Play* button. Also the process can be stopped, paused and resumed.
es: Para escanear pulsa el botón de *Play*. También se puede detener, pausar y reanudar el escaneo.

source: During the scanning, the progress is shown in the bottom of the scene.
es: Durante el escaneo se muestra el progreso en la parte inferior de la escena.

source: You can navigate in the 3D scene using the following shortcuts:
es: Se puede navegar en el visualizador 3D mediante los siguientes accesos rápidos:

source: **Action**
es: **Acción**

source: **Shortcut 1**
es: **Acceso rápido 1**

source: **Shortcut 2**
es: **Acceso rápido 2**

source: Default views
es: Vistas predeterminadas

source: Home / PgUp / PgDn / End
es: Inicio / AvPag / RePag / Fin

source: Rotate
es: Rotación

source: Left click
es: Clic izquierdo

source: Shift + Up/Down
es: Shift + Arriba/Abajo

source: Rotate horizontally
es: Rotación horizontal

source: Up / Down
es: Arriba / Abajo

source: Rotate vertically
es: Rotación vertical

source: Left / Right
es: Izquierda / Derecha

source: Vertical shift
es: Desplazamiento vertical

source: Ctrl + Mouse wheel
es: Ctrl + Rueda ratón

source: Ctrl + Up / Down
es: Ctrl + Arriba / Abajo

source: Reset vertical shift
es: Resetear desplazamiento vertical

source: Dobule left click
es: Doble clic izquierdo

source: Traslation
es: Traslación

source: Shift + Left click
es: Shift + Clic izquierdo

source: Mouse wheel
es: Rueda ratón

source: Shift + Up /Down
es: Ctrl + Arriba / Abajo

source: Delete object
es: Eliminar objeto

source: Right click + Delete object
es: Clic derecho + Eliminar objeto

source: Del
es: Supr

source: Quit program
es: Cerrar el programa

source: Upon completion of the scanning process, the object can be saved in *File > Save model*. The point cloud is saved in *ply* format.
es: Una vez finalizado el proceso de escaneo, el objeto se puede guardar en *Fichero > Guardar modelo*. La nube de puntos se guarda en formato *ply*.

source: When you first open *Horus*, a **Welcome** window appears. This windows has two parts:
es: Al abrir por primera vez *Horus*, aparece una ventana de **Bienvenida**. Esta ventana tiene dos partes:

source: **Create new**: it allows to launch the Wizard or any workbench.
es: **Crear nuevo**: permite lanzar el Wizard o cada uno de los bancos de trabajo.

source: **Open recent file**: it provides direct access to the latest models (*ply* or *stl*).
es: **Abrir fichero reciente**: proporciona un acceso directo a los modelos (*ply* o *stl*) abiertos o creados anteriormente.

source: Pressing over **Wizard mode**, an interactive menu appears for configuring the scanner step by step.
es: Pulsando sobre "Wizard mode" se abre el menú interactivo en el que se configura el escáner paso a paso.

source: Connection window
es: Ventana de conexión

source: This window contains the scanner connection, a preferences panel and the auto check process.
es: Esta ventana contiene la conexión del escáner, las preferencias y el proceso de autocomprobación.

source: **Connect/Disconnect**: connects the camera and the electronics of Ciclop. If a device can not be found, a notification message is thrown.
es: **Conectar/Desconectar**: contecta la cámara y la electrónica de Ciclop. Si no encuentra alguno de los dispositivos se genera una mensaje de notificación.

source: **Preferences**: allows to modify the *Camera ID* and the *Serial name* of the scanner. Also the *Luminosity*. This setting can take *High, Medium or Low* for high, medium of low ambient light. The setting *Invert the motor direction* inverts all the motor angle commands.
es: **Preferencias**: permite modificar el *Id de la cámara* y el *Nombre del puerto serie* del escáner. También la *Luminosidad*. Este parámetro puede tomar los valores *Alto, Medio o Bajo* para luz ambiente alta, media o baja, respectivamente. El parámetro *Invertir la dirección del motor* invierte el ángulo en todos los comandos del motor.I

source: **Auto check**: in order to perform this process, putting the pattern over the platform is required, as shown in the picture. This process makes a full turn of the platform, and checks:
es: **Auto-comprobación**: para realizar este proceso es necesario colocar el patrón correctamente sobre la plataforma, como indica la figura. Este proceso realiza una vuelta completa de la plataforma determinando:

source: **Pattern detection**: indicates whether the pattern is not detected correctly by luminosity or brightness problems.
es: **Detección del patrón**: indica si el patrón no se ha detectado correctamente por problemas de luminosidad o brillo.

source: **Motor direction**: detects if the motor direction is reversed and how to correct it.
es: **Dirección del motor**: detecta si el motor ha sido conectado al revés e indica cómo corregirlo.

source: **Lasers detection**: detects if the lasers have been connected properly and are working.
es: **Detección de los láseres**: detecta si los láserses han sido conectados correctamente y están operativos.

source: The first time *Auto check* is pressed, a menu appears indicating if the lasers want to be aligned. This is for manually moving the orientation of the lasers until the emitted line is perpendicular to the platform. It requires an Allen wrench.
es: La primera vez que se pulsa *Auto comprobación*, aparece un menú indicando si se desean alinear los láseres. Esto es para modificar manualmente la orientación de los láseres hasta que emitan una línea perpendicular a la plataforma. Requiere el uso de una llave Allen.

source: Calibration window
es: Ventana de calibración

source: In this windows both the lasers calibration and the platform calibration are performed.
es: En esta ventana se realiza de forma conjunta la calibración de los láseres y la plataforma giratoria.

source: This calibration process computes the planes in the space respect to the camera for each laser, as well as the spatial relation between the turntable and the optical center of the camera.
es: Esta calibración determina automáticamente los planos en el espacio de cada uno de los láseres con respecto a la cámara, así como la relación espacial entre la plataforma giratoria y el centro óptico de la cámara.

source: The first time the calibration is performed, *Origin pattern distance* must be set. This distance is fundamental for the platform's calibration, because it indicates the real relation between the position of the pattern's sticker and the base.
es: La primera vez se ejecuta el proceso de calibración, hay que introducir la "Distancia al origen del patrón". Esta distancia es fundamental para la calibración de la plataforma, ya que indica la relación entre la posición de la pegatina del patrón y la base.

source: Scanning window
es: Ventana de escaneo

source: In this window, scanning parameters are set:
es: En esta ventana se ajustan los parámetros de escaneo:

source: **Resolution**: it is related to the number of steps per revolution of the motor.
es: **Resolución**: está relacionada con el número de pasos por vuelta del motor.

source: *High*: 800 steps (0.45º)
es: *Alta*: 800 pasos (0.45º)

source: *Medium*: 400 steps (0.9º)
es: *Media*: 400 pasos (0.9º)

source: *Low*: 200 steps (1.8º)
es: *Baja*: 200 pasos (1.8º)

source: **Laser**: selects left laser, right laser or both.
es: *Laser**: se selecciona el láser izquierdo, derecho o ambos.

source: **Capture texture**: enabling this option captures the real color of the object. Otherwise the point cloud has an uniform fake color.
es: **Capturar textura**: al habilitar esta opción, se captura el color real del objeto. De lo contrario la nube de puntos tiene un color uniforme ficticio.

source: Once the **Wizard** is completed, access the main window.
es: Al completar el **Wizard** se accede a la ventana principal.

source: Installation
es: Instalación

source: Install on Mac OS X
es: Instalar en Mac OS X

source: **Supported versions**: 10.9, 10.10, 10.11
es: **Versiones soportadas**: 10.9, 10.10, 10.11

source: System setup
es: Configuración del sistema

source: Install the FTDI drivers
es: Instalar los drivers FTDI

source: `FTDI USB Drivers`_
es: `Drivers FTDI USB`_

source: Install Horus
es: Instalar Horus

source: `Horus installer`_
es: `Instalador de Horus`_

source: Execute the installer and drag Horus icon into *Applications*.
es: Ejecuta el instalador y arrastra el icono de Horus hacia *Aplicaciones*.

source: Reboot the computer to apply the changes.
es: Reinicia el ordenador para aplicar los cambios.

source: Install on Ubuntu
es: Instalar en Ubuntu

source: **Supported versions**: 14.04, 15.04, 15.10, 16.04
es: **Versiones soportadas**: 14.04, 15.04, 15.10, 16.04

source: Official versions are hosted in **ppa:bqlabs/horus**: `PPA Horus`_. Alpha, beta and rc versions are hosted in **ppa:bqlabs/horus-dev**: `PPA Horus dev`_.
es: Las versiones oficiales están alojadas en **ppa:bqlabs/horus**: `PPA Horus`_. Las versiones alpha, beta y rc en **ppa:bqlabs/horus-dev**: `PPA Horus dev`_.

source: A `custom OpenCV`_ version is used, because of the next `reasons`_.
es: Se utiliza una versión `personalizada de OpenCV`_, por las siguientes `razones`_.

source: This command installs all the dependencies, including custom OpenCV libraries.
es: Este comando instala todas las dependencias, incluyendo las bibliotecas de la versión customizada de OpenCV.

source: If user has no access to serial port, execute ``sudo usermod -a -G dialout $USER`` and reboot.
es: Si el usuario no tiene acceso al puerto serie, ejecuta ``sudo usermod -a -G dialout $USER`` y reinicia.

source: Update Horus
es: Actualizar Horus

source: If there is a new release just execute
es: Si hay una nueva versión, ejecuta

source: Install on Windows
es: Instalar en Windows

source: **Supported versions**: 7, 10
es: **Versiones soportadas**: 7, 10

source: Install the USB Camera drivers
es: Instala los drivers de la cámara USB

source: `Logitech Camera C270 Drivers`_
es: `Drivers de la cámara Logitech C270`_

source: Execute the installer and follow the wizard. This package contains all dependencies and also Arduino and FTDI drivers.
es: Ejecuta el instalador y sigue los pasos del wizard. Este paquete contiene todas las dependencias y también los drivers de FTDI y de Arduino.

source: In **Windows 10**, if the application is blurred, follow these steps:
es: En **Windows 10**, si la aplicación aparece borrosa, sigue los siguentes pasos:

source: Right click on the application and select *Properties*
es: Haz click con el botón derecho en la aplicación y selecciona *Propiedades*

source: Go to *Compatibility* tab.
es: Ve a la tab de *Compatibilidad*

source: Under *Settings* section, check *Disable display scaling on high DPI settings*
es: En la sección de *Ajustes*, selecciona *Desactivar la escala de visualización en entornos de alta DPI*

source: *Apply* and close the window.
es: *Aplica* los cambios y cierra la ventana.

source: Board
es: Placa

source: Supported boards
es: Placas soportadas

source: Supported shields
es: Shields soportadas

source: The firmware is an adaptation of Grbl. Releases are hosted here: https://github.com/bqlabs/horus-fw/releases.
es: El firmware es una adaptación de Grbl. Las versiones liberadas están alojadas aquí: https://github.com/bqlabs/horus-fw.

source: It can be uploaded in **Preferences > Upload firmware**.
es: Puede ser cargado en **Preferencias > Cargar firmware**.

source: Troubleshooting
es: Resolución de problemas

source: Board not detected
es: Placa no detectada

source: Sometimes **Arduino UNO** board is not detected correctly, specially if you are using **Windows 10** or **strange clones**. First of all, follow this steps to ensure that your board and your operating system are working fine together:
es: En ocasiones no se detecta correctamente la placa **Arduino UNO**, especialmente si se está utilizando **Windows 10** o **clones extraños**. Para empezar, sigue los siguientes pasos para asegurar que tu placa y tu sistema operativo se comportan bien juntos.

source: Follow this guide to install the drivers and the Arduino IDE: https://www.arduino.cc/en/Guide/Windows.
es: Sigue esta guía para instalar los drivers y el IDE de Arduino: https://www.arduino.cc/en/Guide/Windows.

source: Upload the `blink` example. If it doesn't work go to: https://forum.arduino.cc/ to find a solution.
es: Carga el ejemplo `blink`. Si no funciona ve a: https://forum.arduino.cc/ para buscar una solución.

source: Then if the led is blinking is time to upload the Horus firmware. You have two options:
es: Entonces, si el led está parpadeande es el momento de cargar el firmware de Horus. Tienes dos opciones:

source: In Horus GUI, go to *Preferences*. Select your board and press *Upload firmware*.
es: En Horus GUI, ve a *Preferencias*. Selecciona tu placa y pulsa *Cargar firmware*.

source: In Arduino IDE, download the source code (https://github.com/bqlabs/horus-fw) and upload the file horus-fw.ino.
es: En el IDE de Arduino, descarga el código fuente (https://github.com/bqlabs/horus-fw) y carga el fichero horus-fw.ino.

source: If you have any problem related to the board or the shield please put it here: https://github.com/bqlabs/horus/issues to update this manual.
es: Si tienes cualquier problema relacionado con la placa o la shield, por favor ponlo aquí: https://github.com/bqlabs/horus/issues para actualizar este manual.

source: Camera
es: Cámara

source: Supported cameras
es: Cámaras soportadas

source: HD USB webcam with fixed focus.
es: Cámara HD USB con foco fijo.

source: **Name**
es: **Nombre**

source: **Value**
es: **Valor**

source: **Setting**
es: **Parámetro**

source: Width
es: Ancho

source: Height
es: Alto

source: Frame rate
es: Tasa de refresco

source: Rotation
es: Rotación

source: Yes
es: Sí

source: Horizontal flip
es: Inversión horizontal

source: Vertical flip
es: Inversión vertical

source: Focal length x
es: Distancia focal en x

source: Focal length y
es: Distancia focal en y

source: Optical center x
es: Centro óptico en x

source: Optical center y
es: Centro óptico en y

source: Distortion
es: Distorsión

source: Image controls
es: Controles de imagen

source: **Range**
es: **Rango**

source: Brightness
es: Brillo

source: Contrast
es: Contraste

source: ``contrast_``
es: ``brightness_``

source: Saturation
es: Saturación

source: ``saturation_``
es: ``brightness_``

source: Exposure
es: Exposición

source: ``exposure_``
es: ``brightness_``

source: These parameters have different values for each situation:
es: Estos parámetros tienes diferentes values para cada situación:

source: Capture texture
es: Captura de la textura

source: Pattern detection
es: Detección del patrón

source: Laser detection over the object
es: Detección del láser sobre el objeto

source: Laser detection over the pattern
es: Detección del láser sobre el patrón

source: Therefore, for each case the optimum values can be set.
es: Por lo tanto, para cada caso se pueden establecer los valores óptimos.

source: Flush buffer
es: Vaciar el buffer

source: OpenCV is used to manage the camera. It wraps all the functionality to allow easy access.
es: OpenCV se utiliza para controlar la cámara. Contiene toda la funcionalidad necesaria para permitir un acceso sencillo.

source: At the low level driver, each operating system has different behavior regarding to the buffer of stored images. Moreover, if the exposure time is set over the frame rate (33 ms), buffer filling may vary if image controls are being updated. This may cause synchronization problems between the laser and the camera. Instead of using a long delay to reach the synchronization, a better approach is implemented using custom flush values.
es: En el bajo nivel del driver, cada sistema operativo tiene un comportamiento diferente en relación al buffer de imágenes almacenadas. Más aún, si el tiempo de exposición se sitúa sobre la tasa de refresco (33 ms), el llenado del buffer puede variar si se actualizan los controles de la imagen. Esto puede causar problemas de sincronización entre el láser y la cámara. En vez de utilizar un largo delay para alcanzar la sincronización, se aplica un método mejor utilizando valores personalizados para vaciar el buffer.

source: **OS**
es: **SO**

source: Texture flush
es: Flush de textura

source: Laser flush
es: Flush de láser

source: Pattern flush
es: Flush de patrón

source: In Linux, a `custom OpenCV`_ version is used, because of the next `reasons`_. In Windows and Mac, standard 2.4.9 version is used.
es: En Linux, se utiliza una versión `personalidada de OpenCV`_ por las siguientes `razones`_. En Windows y Mac, se utiliza la versión estándar 2.4.9.

source: Focus image
es: Enfocar imagen

source: Logitech C270 camera is not focused at the scanner working distance (about 300 mm), but it is focused at a longer distance. This may cause inaccurate pattern detection and worse calibration values.
es: La cámara Logitech C270 no está enfocada en la distancia de trabajo del esćaner (sobre 300 mm), sino que está enfocada a una distancia superior. Esto puede causar una detección del patrón menos precisa y peores valores de calibración.

source: To improve that, the camera can be re-focused manually:
es: Para mejorar esto, la cámara puede ser re-enfocada manualmente:

source: Remove the electronics: the camera can not be removed if the board is fixed.
es: Eliminar la electrónica: la cámara no puede ser extraida si la placa está fija.

source: Disassemble the camera: remove the 3 screws and the front cover.
es: Desmontar la cámara: extraer los 3 tornillos y la tapa delantera.

source: Move the lens to break up the glue.
es: Mover la lente para romper el pegamento.

source: Put the camera into the scanner.
es: Monta la cámara en el escáner.

source: Put the pattern on the middle of the platform.
es: Poner el patrón en la mitad de la plataforma.

source: Open the video and move the focus until the pattern is focused.
es: Abrir el vídeo y mover el foco hasta que el patrón esté enfocado.

source: Assemble again the camera and the rest of the scanner.
es: Montar de nuevo la cámara y el resto del escáner.

source: In this `video`_ the camera manual focus is explained.
es: En este `vídeo`_ se explica cómo ajustar manualmente el foco de la cámara.

source: Scanner components
es: Componentes del escáner

source: Lasers
es: Láseres

source: Supported lasers
es: Láseres soportados
