Repository: luc-github/horus
Catalog: doc/readthedocs/locale/*/LC_MESSAGES/source.po
Languages: es

source: In this window, two states are distinguished: while not scanning, it shows the video in texture mode. When the scan starts, you can select several views corresponding to the different stages of the image processing.
es: En esta ventana se distingen dos estados. Mientras no se está escaneando se muestra el video de la cámara en el modo textura. Cuando comienza el escaneo, se pueden seleccionar varias vistas que corresponden con las distintas fases del procesamiento de imagen.

source: **Texture**
es: **Textura**

source: **Gray**
es: **Gris**

source: This section is a three-dimensional scene where the scanned point cloud (model) is shown. Also it allows to view meshes in *stl* format.
es: Esta sección es una escene tridimensional donde se muestra la nube de puntos escaneada. También permite visualizar mallas en formato *stl*.

source: To start scanning press the *Play* button. Also the process can be stopped, paused and resumed. During the scanning, the progress is shown in the bottom of the scene.
es: Para escanear pulsa el botón de *Play*. También se puede detener, pausar y reanudar el escaneo. Durante el escaneo se muestra el progreso en la parte inferior de la escena.

source: To load, save or reset the 3D model, access from the menu *File*.
es: Para cargar, guardar o resetear el modelo, se accede desde el menú *Fichero*.
