Repository: luc-github/horus
Catalog: doc/readthedocs/locale/*/LC_MESSAGES/source.po
Languages: es

source: Line laser
es: Láser de línea

source: Red Class 1 line laser.
es: Láser de línea rojo Clase 1.

source: Wavelength
es: Longitud de onda

source: Voltage
es: Voltaje

source: Working distance
es: Distancia de trabajo

source: Output aperture
es: Apertura de salida

source: Output power
es: Potencia de salida

source: Fan angle
es: Ángulo

source: Body diameter
es: Diámetro de la carcasa

source: Body length
es: Longitud de la carcasa

source: Wire length
es: Longitud del cable

source: Security class
es: Clase de seguridad

source: TÜV certificate
es: Certificado TÜV

source: Only **Class 1** lasers according to *IEC 60825-1:2014* are recommended to ensure eye safety. The emission limits for this wavelength must be less than 390 uW.
es: Solo se recomienda utilizad láseres **Clase 1** de acuerdo a *IEC 60825-1:2014* para asegurar la seguridad del ojo. El límite de emisión para esta longitud de onda debe ser inferior a 390 uW.

source: Switch off the laser specified in the T command.
es: Apaga el láser especificado en el comando T.

source: Switch on the laser specified in the T command.
es: Enciende el láser especificado en el comando T.

source: Lasers are switched off automatically after 255 seconds as a safety measure.
es: Los láseres se apagan automáticamente después de 255 segundos como medida de seguridad.

source: Laser not detected correctly
es: Laser no detectado correctamente

source: If the laser is not detected correctly:
es: Si el láser no se detecta correctamente:

source: Improve the environment light conditions.
es: Mejora las condiciones de luz ambiente.

source: Adjust the camera settings in *Adjustment workbench*:
es: Ajusta los parámetros de la cámara en el *Banco de trabajo de ajuste*:

source: *Scan capture > Laser* for the laser over the scanning object.
es: *Captura del escáner > Laser* para el laser sobre el objeto escaneado.

source: *Calibration capture > Laser* for the laser over the pattern.
es: *Captura de la calibración > Laser* para el laser sobre el patrón.

source: Supported motors
es: Motores soportados

source: Bipolar stepper motor.
es: Motor paso a paso bipolar.

source: Phase
es: Fase

source: Step angle
es: Ángulo del paso

source: Shaft height
es: Altura del eje

source: Body height
es: Altura del motor

source: Chamfer
es: Chaflán

source: Perform an angular movement. Using the F command, the angular speed is set to the specified value in degrees per second. Also with the X command, the motor moves to the specified absolute position in degrees.
es: Realiza un movimiento angular. Utilizando el comando F, se ajusta la velocidad angular en grados por segundo. También, con el comando X, el motor se mueve al ángulo absoluto especificado en grados.

source: Reset all positions to zero. It is recommended to be executed after M18 to avoid the oscillation anchor.
es: Resetea todas las posiciones a cero. Se recomienda utilizar después del comando M18 para evitar la oscilación de anclaje.

source: Enable the motor. It remains enabled even after sending G1 commands.
es: Habilita el motor. Permanece habilitado incluso después de enviar comandos G1.

source: If the motor is enabled for a long time, the driver and the motor can overheat and even break.
es: Si el motor está habilitado durante mucho tiempo, el driver y el motor se pueden sobrecalentar e incluso estropear.

source: Disable the motor. It remains disabled even after sending G1 commands.
es: Deshabilitar el motor. Permanece deshabilitado incluso después de enviar comandos G1.

source: Reversed direction of rotation
es: Sentido de rotación invertido

source: Motor rotation must turn in a counterclockwise direction with positive angles. If it turns in reverse, probably the connector is connected in the wrong way. This can be solved by editing the parameter ``invert_motor`` in Preferences > Invert the motor direction.
es: La rotación del motor debe ser en el sentido contrario a las agujas del reloj para ángulos positivos. Si gira en sentido contrario, probablemente el conector esté conectado al revés. Esto se puede resolver editando el parámetro ``invert_motor`` en Preferencias > Invertir la dirección del motor.

source: Strange movements
es: Movimientos extraños

source: To avoid possible strange movements in the motor:
es: Para evitar posibles movimientos extraños en el motor:

source: Make sure the motor step is 1.8º.
es: Asegurate que el paso del motor es 1.8º.

source: Put all the jumpers in the Zum Scan board to enable micro-stepping.
es: Pon todos los jumpers en la placa Zum Scan para habilitar los micro-pasos.

source: Adjust the electrical current with the potentiometer in the pololu driver. Recommended values are about 200 mA.
es: Ajusta la corriente eléctrica con el potenciómetro en el driver de pololu. Se recomiendan valores sobre 200 mA.

source: Pattern
es: Patrón

source: Supported pattern
es: Patrónes soportados

source: Chessboard patterns
es: Patrones de tablero de ajedrez

source: Rows
es: Filas

source: Columns
es: Columnas

source: Square width
es: Ancho del cuadrado

source: Origin distance
es: Distancia al origen

source: These values can be set in *Calibration workbench > Pattern settings*.
es: Estos valores se puedes ajustar en el *Banco de trabajo de calibración > Ajustes del patrón*.

source: It must be an odd number of columns in order to define an unique origin of the pattern.
es: Debe haber un número impar de columnas para definir un único origen en el patrón.

source: The origin distance is the minimum distance between the origin of the pattern (bottom-left corner) and the pattern's base surface. This value is used to define where is the pattern with respect to the turntable.
es: La distancia al origen es la mínima distancia entre el origen del patrón (esquina inferior izquierda) y la base del patrón. Este valor se utiliza para definir dónde está el patrón con respecto a la plataforma giratoria.

source: When the pattern is correctly detected, the following colored dots and lines are drawn.
es: Cuando el patrón se detecta correctamente, aparecen los siguientes puntos y líneas coloreadas.

source: Pattern not detected
es: Patrón no detectado

source: If the pattern is not detected:
es: Si el patrón no se detecta:

source: Check the *Calibration workbench > Pattern settings*.
es: Comprueba los parámetros en el *Banco de trabajo de calibración > Ajustes del patrón*.

source: Adjust the camera settings in *Adjustment workbench > Calibration capture > Pattern*.
es: Ajusta los parámetros de la cámara en el *Banco de trabajo de ajuste > Captura de la calibración > Patrón*.

source: Adjustment
es: Ajuste

source: In this workbench, camera capture and image processing parameters are adjusted for the different states of the system. The current state and its changes are displayed in the video wall in real time.
es: En este banco de trabajo se ajustan los parámetros de captura de la cámara y procesamiento de imagen para los distintos estados del sistema. En todo momento se pueden observar los cambios de los ajustes en el video.

source: Scanning adjustments
es: Ajustes de escaneo

source: These settings are applied during the scanning process.
es: Estos ajustes se aplican durante el proceso de escaneado.

source: Capture
es: Captura

source: In this section you can adjust the parameters of the capture during the scanning process. These parameters must be adjusted with the object to be scanned.
es: En esta sección se ajustan los parámetros correspondientes a la captura durante el proceso de escaneado. Estos parámetros de deben ajustar con el objeto a escanear.

source: The *Texture mode* contains the settings used to capture the texture/color of the scanned object. These are: brightness, constrast, saturation and exposure.
es: El *Modo textura* contiene los parámetros que utilizará el escáner para capturar la textura/color del objeto. Éstos son: brillo, contraste, saturación y exposición.

source: The *Laser mode* contains the settings used to capture and detect the laser over the scanned object. These are: brightness, constrast, saturation, exposure and background removal. The *Remove background* option improves the laser detection by consuming twice as long.
es: El *Modo láser* contiene los parámetros que utilizará el escáner para capturar y detectar el láser sobre el objeto escaneado. Éstos son: brillo, contraste, saturación, exposición y eliminación del fondo. La opción *Eliminar fondo* mejora la detección de los láseres a costa de consumir el doble de tiempo.

source: Segmentation
es: Segmentación

source: In this section you can adjust the parameters for the laser stripe segmentation during the scanning process.
es: En esta sección se ajustan los parámetros para la segmentación de la curva del láser durante el proceso de escaneo.

source: **Draw line**: show the computed lines in red from the segmented laser image.
es: **Mostrar línea**: muestra las líneas en rojo obtenidas a partir de la imagen del láser segmentada.

source: **Threshold**: remove all pixels which intensity is less that the threshold value.
es: **Umbral**: elimina todos los píxeles cuya intensidad sea inferior al valor límite.

source: **Blur**: blur with Normalized box filter. Kernel size: 2 * value + 1.
es: **Desenfoque**: desenfoque con el filtro Normalized box. Tamaño del kernel: 2 * valor + 1.

source: **Window**: filter pixels out of 2 * window value around the intensity peak.
es: **Ventana**: filtra píxeles fuera del valor * 2 alrededor de la intensidad máxima.

source: **Refinement**: apply None or SGF algorithms for line smooth. SGF produces continous surfaces.
es: **Refinamiento**: aplica el algoritmo SGF para suavizar la línea. SGF produce superficies continuas.

source: Calibration adjustments
es: Ajustes de la calibración

source: These settings are applied during the calibration processes.
es: Estos ajustes se aplican durante el proceso de calibración.

source: In this section you can adjust the parameters of the capture during the calibration process. These parameters must be adjusted with the calibration pattern.
es: En esta sección se ajustan los parámetros correspondientes a la captura durante el proceso de calibración. Estos parámetros de deben ajustar con el patrón de calibración.

source: The *Pattern mode* contains the settings used to capture the pattern. These are: brightness, constrast, saturation and exposure.
es: El *Modo patrón* contiene los parámetros que utilizará el escáner para detectar el patrón. Éstos son: brillo, contraste, saturación y exposición.

source: The *Laser mode* contains the settings used to capture and detect the laser over the pattern. These are: brightness, constrast, saturation, exposure and background removal. The *Remove background* option improves the laser detection by consuming twice as long.
es: El *Modo láser* contiene los parámetros que utilizará el escáner para capturar y detectar el láser sobre el patrón. Éstos son: brillo, contraste, saturación, exposición y eliminación del fondo. La opción *Eliminar fondo* facilita la detección de los láseres a costa de consumir el doble de tiempo.

source: In this section you can adjust the parameters for the laser stripe segmentation during the calibration processes.
es: En esta sección se ajustan los parámetros para la segmentación de la curva del láser durante el proceso de calibración.

source: **Refinement**: apply None, SGF, RANSAC algorithms for line smooth. SGF produces continous surfaces. RANSAC produces flat surfaces.
es: **Refinamiento**: aplica los algoritmos SGF y RANSAC para suavizar la línea. SGF produce superficies continuas. RANSAC produce superficies planas.

source: Calibration
es: Calibración

source: This workbench contains all the scanner calibration processes.
es: Este banco de trabajo contiene todos los procesos de calibración del escáner.

source: Pattern settings
es: Ajustes del patrón

source: This section contains the calibration pattern features:
es: Esta sección contiene las características del patrón de calibración.

source: **Pattern rows**: number of corner rows in the pattern. Default value 6.
es: **Filas del patrón**: número de filas esquina del patrón. Valor por defecto 6.

source: **Pattern columns**: number of corner columns in the pattern. Default value 11.
es: **Columnas del patrón**: número de columnas esquina del patrón. Valor por defecto 11.

source: **Square width**: default value 13 mm.
es: **Ancho del cuadrado**: valor por defecto 13 mm.

source: **Origin distance**: minimum distance between the origin of the pattern (bottom-left corner) and the pattern's base surface in mm. There is no default value because it depends on the physical pattern.
es: **Distancia al origen el patrón**: es la mínima distancia entre el origen del patrón (esquina inferior izquierda) y la base del patrón en mm. No hay un valor por defecto porque depende del patrón físico.

source: Autocheck
es: Auto comprobación

source: This section contains the auto check process in which is detected whether the pattern, motor and lasers are configured properly.
es: Esta sección contiene el proceso de auto comprobación en el que se detecta si el patrón, el motor y los láseres están configurados correctamente.

source: The pattern should be placed as shown in the picture. If the process ends successfully, the pattern will be placed perpendicular to the camera. Otherwise, a notification will be displayed.
es: El patrón se debe colocar como se indica en la figura. Si la auto comprobación finaliza con éxito, el patrón se colocará perpendicular a la cámara. De lo contrario, se mostrará una notificación.

source: Laser calibration
es: Calibración de los láseres

source: In this section, the laser's planes are calculated. Each plane is defined by a normal vector and the minimum distance from the plane to the optical center of the camera.
es: En esta sección se determinan los planos de los láseres. Cada plano se define mediante un vector normal y la distancia mínima del plano al centro óptico del a cámara.

source: To begin the calibration, the pattern must be placed perpendicular to the camera, as shown in the picture. At any time you can cancel the calibration and the pattern will return to its initial position.
es: Para comenzar la calibración, hay que colocar el patrón perpendicular a la cámara, tal y como se muestra en la figura. En cualquier momento se puede cancelar la calibración y el patrón se colocará en su posición inicial.

source: Finally the result is shown numerically and depicted in 3D. Also, the dispersion of the captured points during calibration appears. This value must be less than 0.1 mm. You can accept or reject the calibration result.
es: Finalmente se muestra el resultado de forma numérica y representado en 3D. También, aparece la dispersión de los puntos capturados durante la calibración. Éste valor debe ser menor que 0.1 mm. Se puede aceptar o rechazar el resultado de la calibración.

source: Platform calibration
es: Calibración de la plataforma

source: In this section, the homogeneous transformation matrix from the rotation center of the turntable with respect to the camera system is calculated. This matrix is composed by a rotation matrix and a traslation vector in mm.
es: En esta sección, se determina la matriz de transformación homogénea del centro de rotación de la plataforma giratoria con respecto al sistema de la cámara. Esto consiste en una matriz compuesta por una matriz de rotación y un vector de traslación en unidades de milímetros.

source: Finally the result is shown numerically and depicted in 3D. You can accept or reject the calibration result.
es: Finalmente se muestra el resultado de forma numérica y representado en 3D. Se puede aceptar o rechazar el resultado de la calibración.

source: Once this process is completed, the scanner is calibrated.
es: Una vez completado este proceso, el escáner ya está calibrado.

source: Video settings (advanced)
es: Ajustes del vídeo (avanzado)

source: This is an advanced section. It contains the rotation flags for the video. Also you can set the camera resolution in px.
es: Esta es una sección avanzada. Contiene los flags de rotación para el vídeo. También se puede ajustar la resolución de la cámara en px.

source: If a wrong resolution is set, the nearest resolution is recommended. Also, you can go back to the latest resolution.
es: Si se configura una resolución incorrecta, se recomienda la resolución válida más cercana. También, se puede volver a la anterior resolución.

source: In Mac OS the resolution can not be set in runtime because of its OpenCV version.
es: En Mac OS la resolución no se puede modificar en tiempo de ejecución por la versión de OpenCV.

source: Camera calibration (advanced)
es: Calibración de la cámara (avanzado)

source: This is an advanced section. Default values are recommended.
es: Esta es una sección avanzada. Se recomienda utilizar los valores por defecto.

source: To begin the calibration, press the "space" key to capture the pattern in different positions. Once taken all the captures, the calibration starts automatically. You can reset the taken captures at any time.
es: Para comenzar esta calibración, pulsa la tecla "espacio" para capturar el patrón en distintas posiciones. Una vez tomadas todas las capturas la calibración se inicia de forma automática. En cualquier momento se pueden resetear las capturas tomadas anteriormente.

source: If camera intrinsics values are modified, laser and platform calibrations must be performed again.
es: Si se modifican los valores intrínsecos de la cámara, se deben realizar las calibraciones de los láseres y la plataforma de nuevo.

source: To enable the advanced mode go to the menu *View > Advanced mode*.
es: Para habilitar el modo avanzado ve al menu *Vista > Modo avanzado*.

source: This workbench is used to test the scanner components: camera, lasers and motor.
es: Este banco de trabajo sirve para probar los componentes del escáner: cámara, láseres y motor.

source: In this section you can adjust the brightness, contrast, saturation and exposure of the camera.
es: En esta sección se puede ajustar el brillo, contraste, saturación y exposición de la cámara.

source: Also it allows to capture and save images from the camera in *png* format.
es: Además permite capturar y guardar imágenes de la cámara en formato *png*.

source: Laser
es: Láser

source: In this section you can turn on and off the lasers. When leaving the workbench the lasers are automatically turned off.
es: En esta sección se pueden encender y apagar los dos láseres. Al salir del banco de trabajo los láseres se apagan automáticamente.

source: In this section you can move the motor to an absolute angle, with a specific speed and acceleration. These values affect only to this workbench.
es: En esta sección se puede mover el motor a un ángulo absoluto, con una velocidad y aceleración específicas. Éstos valores sólo afectan a este banco de trabajo.

source: Also the motor can be enabled or disabled and the position stored inside the firmware reseted.
es: También se puede habilitar o deshabilitar el motor, así como reiniciar la posición del motor almacenada en el firmware.

source: This section contains a terminal that allows to communicate with the firmware through Gcode commands.
es: Esta sección presenta una terminal que permite comunicarse con el firmware por medio de comandos Gcode.

source: Workbenches
es: Bancos de trabajo

source: This workbench is where the 3D scanning process is performed. This process generates a three dimensional point cloud from a physical object. It has three components:
es: Este banco de trabajo es donde se realiza el proceso de escaneado 3D. Este proceso genera una nube de puntos tridimensional a partir de un objeto físico. Tiene tres componentes:

source: Settings panel
es: Panel de ajustes

source: Video wall
es: Panel de video

source: 3D scene
es: Escena 3D

source: Through the menu *View* these panels can be shown or hidden.
es: Mediante el menu *Vista* se pueden mostrar y ocultar estos paneles.

source: Scan parameters
es: Parámetros del escaneo

source: **Capture texture**: enabling this option captures the real color of the object. Otherwise the point cloud has an uniform fake color. If this option is disabled, the process is faster and the color used is the one defined in the *Point cloud color* section.
es: **Capturar textura**: al habilitar esta opción se captura el color real del objeto. De lo contrario la nube de puntos tiene un color uniforme ficticio. Si esta opción está deshabilitada, el proceso es más rápido y el color utilizado es el definido en la sección *Color de la nube de puntos*.

source: **Use laser**: selects left laser, right laser or both.
es: **Laser**: selecciona el láser izquierdo, derecho o ambos.

source: Rotating platform
es: Plataforma giratoria

source: **Show center**: shows the center of the platform using the current calibration values.
es: **Mostrar centro**: muestra el centro de la plataforma utilizando los valores actuales de la calibración.

source: **Step**: is the angle increased in each scan iteration. The smaller the step, the greater radial resolution, and also more scanning time. The default value is 0.45º, that is 800 steps per revolution.
es: **Paso**: es el ángulo que avanza el motor en cada iteración de escaneado. Cuanto menor sea el paso, mayor será la resolución radial, así como el tiempo de escaneao. El valor por defecto es 0.45º, que se corresponde con 800 pasos por vuelta.

source: **Speed**: is the motor speed in degrees per second. Te default value is 200 º/s.
es: **Velocidad**: es la velocidad con la que avanza el motor en grados por segunto. El valor por defecto es 200º/s.

source: **Acceleration**: is the motor acceleration in degress per secon squared. The default value is 200 º/s².
es: **Aceleración**: es la aceleración del motor en grados por segundo al cuadrado. El valor por defecto es 200 º/s².

source: Point cloud ROI
es: ROI de la nube de puntos

source: In this section the ROI (Region of interest) is defined. It is a cylindrical volume in the point cloud and a rectangle in the video.
es: En esta sección se define la ROI (región de interés). Es un volumen cilíndrico en la nube de puntos y un rectángulo en el vídeo.

source: **Use ROI**: enabling this option applies the ROI. This region is the one being scanned both in the video and in the point cloud. All information outside won't be taken into account during the scanning process.
es: **Usar ROI**: al habilitar esta opción se aplica la Región de Interés (ROI, por sus siglas en inglés). Esta es la región cilíndrica que se va a escanear. La información que esté situada fuera de ella no se tendrá en cuenta durante el escaneo.

source: **Diameter**: ROI diameter in mm. The default value is 200 mm.
es: **Diámetro**: diámetro de la ROI en mm. El valor por defecto es 200 mm.

source: **Height**: ROI height in mm. The default value is 200 mm.
es: **Altura**: altura de la ROI en mm. El valor por defecto es 200 mm.

source: Point cloud color
es: Color de la nube de puntos

source: In this section is selected the color for the point cloud when no texture is captured.
es: En esta sección se selecciona el color de la nube de puntos cuando no se captura la textura del objeto.

source: The *Settings panel* is hidden during the scanning process.
es: El *Panel de parámetros* se oculta durante el proceso de escaneado.
